
# YOLOv8n-ultralight for Jetson Nano
nc: 4  # number of classes
depth_multiple: 0.33
width_multiple: 0.25
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

backbone:
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 3, C2f, [256]]  # 4
  - [-1, 1, Conv, [384, 3, 2]]  # 5-P4/16
  - [-1, 3, C2f, [384]]  # 6
  - [-1, 1, Conv, [512, 3, 2]]  # 7-P5/32
  - [-1, 1, C2f, [512]]  # 8
head:
  - [-1, 1, SPPF, [512, 5]]  # 9
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 1, C2f, [384]]  # 12
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 1, C2f, [256]]  # 15
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]  # cat head P4
  - [-1, 1, C2f, [384]]  # 18
  - [-1, 1, Conv, [384, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]  # cat head P5
  - [-1, 1, C2f, [512]]  # 21
  - [[15, 18, 21], 1, Detect, [nc]]  # Detect(P3, P4, P5)
    